INSERT INTO shows (name, description, postername) VALUES ('Новогодний переполох', 'Супер-хорек Фред и птичка Кери,
хотят что бы подарки к Новому Году, были у всех животных. Они отправляются на фабрику игрушек и сладостей, прямо к Деду
Морозу. Им пытается помешать крыса Редерик, которая хочет украсть все новогодние подарки у детей и животных.', 'poster_1.jpg');

INSERT INTO shows (name, description, postername) VALUES ('Чинк: хвостатый детектив', 'Жители Медовой Долины
готовятся к любимому празднику — Дню Города, когда у всех горожан есть возможность полюбоваться уникальным артефактом —
Золотым Ульем. По преданию он был найден основателями Медовой Долины, и легенда гласит, что на городок обрушатся тысячи
несчастий, если Улей пропадет. Накануне праздника Улей похищен. Винят в этом бельчонка Чинка, помощника совы-детектива
Софи. Чинку и его друзьям предстоит распутать дело, найти настоящего жулика и вернуть не только Золотой Улей, но и мир
в Долину.', 'poster_2.jpg');

INSERT INTO shows (name, description, postername) VALUES ('Царство против разбойников', 'Юный царевич отказывается
платить ежегодную дань разбойникам и нанимает на службу двух странствующих актеров, выдающих себя за богатырей. Конечно,
 они проигрывают сражение за деревню, и теперь им придется исправить ситуацию, взявшись за дело серьезно.', 'poster_3.jpg');

INSERT INTO shows (name, description, postername) VALUES ('СантаМэн', 'Увлекательное фэнтезийное приключение,
которое даст возможность понять истинную ценность детских фантазий и отлично подойдет для семейного просмотра под Новый
 Год. «Сантамэн» - это невероятно позитивный,  душевный мультфильм, который порадует зрителя неожиданными поворотами
 сюжета, понятным для всей семьи юмором и, конечно же, новогодней атмосферой! ', 'poster_4.jpg');
